tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'ack' # grep-like tool
brew 'bat' # cat(1) with wings
brew 'gh' # GitHub CLI
brew 'git' # Git CLI
brew 'hub' # GitHub CLI
brew 'nvm' # Node Version Manager
brew 'openssl' # OpenSSL
brew 'starship' # CLI tool for managing your projects
brew 'thefuck'# Correct your previous command
brew 'tldr' # man page alternative
brew 'trash' # rm enancher
brew 'watchman' # file watcher
brew 'webp' # image optimization
brew 'youtube-dl' # YouTube downloader
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

cask 'android-file-transfer' # Android File Transfer
cask 'bitwarden' # password manager
cask 'caffeine' # keeps screen awake
cask 'dropbox' # file sharing
cask 'firefox' # web browser
cask 'flux' # change screen brightness
cask 'google-chrome' # web browser
cask 'insomnia' # API debugger
cask 'imageoptim' # image optimization
cask 'iterm2' # terminal
cask 'jumpcut' # clipboard manager
cask 'krisp' # noise cancelling
cask 'macdown' # markdown editor
cask 'rectangle' # window manager
cask 'slack' # chat
cask 'sourcetree'# git client
cask 'spotify' # music
cask 'the-unarchiver' # archive manager
cask 'transmission' # torrent client
cask 'visual-studio-code' # code editor
cask 'vlc' # video player

# QuickLook plugins
cask 'betterzip'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# Custome font
cask 'font-fira-code-nerd-font'
