tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'ack' # grep-like tool
brew 'awscli' # AWS CLI
brew 'bat' # cat(1) with wings
brew 'deno' # TS and JS runtime
brew 'gh' # GitHub CLI
brew 'git' # Git CLI
brew 'grip' # Git Readme Instant Preview
brew 'httpie' # HTTPie
brew 'hub' # GitHub CLI
brew 'jq' # Command-line JSON processor
brew 'nvm' # Node Version Manager
brew 'openssl' # OpenSSL
brew 'pnpm' # Alternative to npm
brew 'starship' # CLI tool for managing your projects
brew 'thefuck'# Correct your previous command
brew 'tldr' # man page alternative
brew 'trash' # rm enancher
brew 'webp' # image optimization
brew 'youtube-dl' # YouTube downloader
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

cask '1password' # password manager
cask '1password-cli'# 1password cli
cask 'android-file-transfer' # Android File Transfer
cask 'apparency' # inspect other Apps installed
cask 'appcleaner' # uninstall apps
cask 'arc' # web browser
cask 'brave-browser' # web browser
cask 'bruno' # API tester
cask 'discord' # chat
cask 'dropbox' # file sharing
cask 'firefox' # web browser
cask 'flux' # change screen brightness
cask 'google-chrome' # web browser
cask 'grammarly-desktop' # grammar checker
cask 'handbrake' # video encoder
cask 'imageoptim' # image optimization
cask 'insomnia' # API tester
cask 'iterm2' # terminal
cask 'keepingyouawake' # wake up computer
cask 'krisp' # noise cancelling
cask 'macdown' # markdown editor
cask 'openvpn-connect' # vpn connection
cask 'raycast' # alternative to spotlight
cask 'raindropio' # bookmark manager
cask 'rectangle' # window manager
cask 'slack' # chat
cask 'sloth' # process manager
cask 'sourcetree'# git client
cask 'spotify' # music
cask 'todoist' # todo list
cask 'transmission' # torrent client
cask 'visual-studio-code' # code editor
cask 'vlc' # video player
cask 'whatsapp' # chat

# QuickLook plugins
cask 'betterzip'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'webpquicklook'

# Custome font
cask 'font-fira-code-nerd-font'
